<a href="https://colab.research.google.com/github/Elizaluckianchikova/Biostatistics/blob/main/%D0%9A%D0%BE%D0%BF%D0%B8%D1%8F_%D0%B1%D0%BB%D0%BE%D0%BA%D0%BD%D0%BE%D1%82%D0%B0_%22HW_4_DB_Luckyanchikova_ipynb%22.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Домашние задание 4

Необходимо написать `.py` скрипт, который будет обращаться к любой вашей базе
данных и выполнять:

- a. Читать таблицу и выводить в консоль всю прочитанную информацию
- b. Читать таблицу с условием `WHERE` и выводить в консоль только один атрибут таблицы
- c. Вставить запись в любую таблицу и вывести в консоль идентификатор новой записи
- d. Удалить вставленную запись из пункта с

In [ ]:
!pip install psycopg2-binary

Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.9-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.0/3.0 MB 27.3 MB/s eta 0:00:00
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.9

In [ ]:
import psycopg2
import pandas as pd

Загружаем БД library

In [ ]:
conn = psycopg2.connect(
    host="localhost",
    database="library",
    user="postgres",
    password="4321"
)

In [ ]:
def sql_command(query, database):
    cur = database.cursor()
    cur.execute(query)
    try:
        rows = cur.fetchall()
        colnames = [desc[0] for desc in cur.description]
        cur.close()
        return pd.DataFrame(rows,columns=colnames)
    except psycopg2.ProgrammingError:
        cur.close()
        return 'query done'

In [ ]:
sql_command("SELECT * FROM reader", conn)

     id_reader first_name  last_name reader_num
0            1      Clyde      Adams      23514
1            2      Helen      Adams      23657
2            3     Dianne     Adkins      23637
3            4    Theresa     Adkins      23544
4            5     Silvia  Armstrong      23636
..         ...        ...        ...        ...
236        237     Connie     Wilson      23546
237        238       Iris       Wise      23459
238        239    Bridget      Wolfe      23550
239        240     Tyrone      Woods      23524
240        241    Abraham      Young      23492

[241 rows x 4 columns]

In [ ]:
sql_command("SELECT first_name FROM reader WHERE first_name='Helen'", conn)

  first_name
0      Helen
1      Helen

In [ ]:
sql_command("INSERT INTO reader VALUES (666, 'Grisha', 'Vykhodtsev', 23900)", conn)

'query done'

In [ ]:
sql_command("SELECT * FROM reader WHERE id_reader = 666", conn)

   id_reader first_name   last_name reader_num
0        666     Grisha  Vykhodtsev      23900

In [ ]:
sql_command("DELETE FROM reader WHERE id_reader = 666", conn)

'query done'

In [ ]:
sql_command("SELECT * FROM reader", conn)

     id_reader first_name  last_name reader_num
0            1      Clyde      Adams      23514
1            2      Helen      Adams      23657
2            3     Dianne     Adkins      23637
3            4    Theresa     Adkins      23544
4            5     Silvia  Armstrong      23636
..         ...        ...        ...        ...
236        237     Connie     Wilson      23546
237        238       Iris       Wise      23459
238        239    Bridget      Wolfe      23550
239        240     Tyrone      Woods      23524
240        241    Abraham      Young      23492

[241 rows x 4 columns]

In [ ]:
class dotfunc:
    func_dict = {'plus': lambda x, y: x + y,
                'minus': lambda x, y: x - y,
                'times': lambda x, y: x * y}
    def __init__(self, value, name):
        self.value = value
        self.func = self.func_dict[name]

    def __getattr__(self, attr):
        return Number(self.func(self.value, num_dict[attr].value))

class Number:
    def __init__(self, value):
        self.value = value

    def __getattr__(self, attr):
        return dotfunc(self.value, attr)

    def __repr__(self):
        return str(self.value)

zero = Number(0)
one = Number(1)
two = Number(2)
three = Number(3)
four = Number(4)
five = Number(5)
six = Number(6)
seven = Number(7)
eight = Number(8)
nine = Number(9)

num_dict = {'zero': zero,
                'one' : one,
                'two' : two,
                'three' : three,
                'four' : four,
                'five' : five,
                'six' : six,
                'seven' : seven,
                'eight' : eight,
                'nine' : nine}

In [ ]:
print(five)  # 5
print(five.minus.three)  # 2
print(two.plus.two)  # 4
print(five.plus.two.times.four)  # 28
print(nine.times.nine.times.nine)  # 729

5
2
4
28
729

In [ ]:
pip install mypy

Collecting mypy
  Downloading mypy-1.6.1-cp39-cp39-macosx_10_9_x86_64.whl (10.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.7/10.7 MB 8.0 MB/s eta 0:00:0000:01m0:01
Requirement already satisfied: tomli>=1.1.0 in /Users/grinder/opt/anaconda3/lib/python3.9/site-packages (from mypy) (2.0.1)
Collecting mypy-extensions>=1.0.0
  Downloading mypy_extensions-1.0.0-py3-none-any.whl (4.7 kB)
Requirement already satisfied: typing-extensions>=4.1.0 in /Users/grinder/opt/anaconda3/lib/python3.9/site-packages (from mypy) (4.3.0)
Installing collected packages: mypy-extensions, mypy
  Attempting uninstall: mypy-extensions
    Found existing installation: mypy-extensions 0.4.3
    Uninstalling mypy-extensions-0.4.3:
      Successfully uninstalled mypy-extensions-0.4.3
Successfully installed mypy-1.6.1 mypy-extensions-1.0.0
Note: you may need to restart the kernel to use updated packages.

In [ ]:
!mypy check_mypy.py

Success: no issues found in 1 source file

In [ ]:
class A:
    def __getitem__(self, index):
        if index[0].start is None:
            print(True
        return index

In [ ]:
a = A()
index = a[:,:]

In [ ]:
# index[0].start is None
# len(index) == 2
# isinstance(index[0], slice)
# index == (:, :)
# index[0].indices(10) == (0, 10, 1)
# isinstance(index, list)

False

In [ ]:
print(index[0].__doc__)

slice(stop)
slice(start, stop[, step])

Create a slice object.  This is used for extended slicing (e.g. a[0:10:2]).

In [ ]:
import asdfa

ModuleNotFoundError: No module named 'asdfa'